<?php
function sonderzeichen($string)
{
$search = array("Ä", "Ö", "Ü", "ä", "ö", "ü", "ß", "´","À","à","Â","â","Æ","æ","Ç","ç","È","è","É","é","Ê","ê","Ë","ë","Î","î","Ï","ï","Ô","ô","Œ","œ","Ù","ù","Û","û","Ÿ","ÿ","â","Ç","ç","Ğ","ğ","İ","i","I","ı","î","Ö","ö","Ş","ş","Ü","ü");
$replace = array("Ae", "Oe", "Ue", "ae", "oe", "ue", "ss", "A","a","A","a","AE","ae","C","c","E","e","E","e","E","e","E","e","I","i","I","i","O","o","CE","ce","U","u","U","u","Y","y","a","C","c","G","g","I","i","I","i","i","O","o","S","s","U","u");
return str_replace($search, $replace, $string);
}
?>
